# Notebook Structure for SQL EDA

## 1️⃣ Introduction & Setup
- Brief project overview  
- Connect to the SQL database (e.g., PostgreSQL, MySQL, SQL Server)  
- Load required Python libraries (for executing SQL, not visualization)  

## 2️⃣ Data Overview
- Query to inspect the dataset (e.g., `SELECT * FROM table LIMIT 10;`)  
- Basic structure: column names, data types  

## 3️⃣ Missing Values & Data Cleaning
- Query to check for missing values  
- Strategies for handling missing data  
- Export cleaned data to CSV for Tableau/Power BI  

## 4️⃣ Summary Statistics
- Queries to calculate mean, median, min, max, standard deviation  
- Export results as a CSV for visualization  

## 5️⃣ Distributions & Trends
- Queries for frequency distributions, categorical counts, and trends  
- Export findings to a structured format  

## 6️⃣ Correlation Analysis
- Queries to compute correlations (if applicable)  
- Insights from SQL-based statistical summaries  

## 7️⃣ Final Summary & Export
- Write key insights in Markdown format  
- Save all processed data as CSVs for use in Tableau/Power BI

In [53]:
import mysql.connector as sql
from sqlalchemy import create_engine
from tabulate import tabulate
import pandas as pd

In [54]:
# first we will make connection to the server
connection = sql.connect(
    host = "localhost",
    user = "root",
    password = "Ayoub1111",
    allow_local_infile = True,
    use_pure = True
)

In [55]:
cursor = connection.cursor()

In [56]:
cursor.execute("CREATE DATABASE IF NOT EXISTS employees")

In [57]:
connection.database = "employees"

In [58]:
cursor.execute("select * from titles limit 10")
rows = cursor.fetchall()

In [59]:
for row in rows:
    print(row)

(10001, 'Senior Engineer', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1))
(10002, 'Staff', datetime.date(1996, 8, 3), datetime.date(9999, 1, 1))
(10003, 'Senior Engineer', datetime.date(1995, 12, 3), datetime.date(9999, 1, 1))
(10004, 'Engineer', datetime.date(1986, 12, 1), datetime.date(1995, 12, 1))
(10004, 'Senior Engineer', datetime.date(1995, 12, 1), datetime.date(9999, 1, 1))
(10005, 'Senior Staff', datetime.date(1996, 9, 12), datetime.date(9999, 1, 1))
(10005, 'Staff', datetime.date(1989, 9, 12), datetime.date(1996, 9, 12))
(10006, 'Senior Engineer', datetime.date(1990, 8, 5), datetime.date(9999, 1, 1))
(10007, 'Senior Staff', datetime.date(1996, 2, 11), datetime.date(9999, 1, 1))
(10007, 'Staff', datetime.date(1989, 2, 10), datetime.date(1996, 2, 11))

### Get a Quick Overview of the Data
- display tables inside the employees database

In [60]:
query1 = "select * from current_dept_emp limit 10"
query2 = "select * from departments limit 10"
query3 = "select * from dept_emp limit 10"
query4 = "select * from dept_emp_latest_date limit 10"
query5 = "select * from dept_manager limit 10"
query6 = "select * from employees limit 10"
query7 = "select * from  salaries limit 10"
query8 = "select * from titles limit 10"

In [61]:
current_dept_emp = pd.read_sql(query1, connection)
departments = pd.read_sql(query2, connection)
dept_emp = pd.read_sql(query3, connection)
dept_emp_latest_date = pd.read_sql(query4, connection)
dept_manager = pd.read_sql(query5, connection)
employees = pd.read_sql(query6, connection)
salaries = pd.read_sql(query7, connection)
titles = pd.read_sql(query8, connection)

/tmp/ipykernel_6545/2694205308.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  current_dept_emp = pd.read_sql(query1, connection)
/tmp/ipykernel_6545/2694205308.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  departments = pd.read_sql(query2, connection)
/tmp/ipykernel_6545/2694205308.py:3: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  dept_emp = pd.read_sql(query3, connection)
/tmp/ipykernel_6545/2694205308.py:4: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  dept_emp_latest_date = pd.read_sql(query4, connection)
/tmp/ipykernel_6545/2694205308.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  dept_manager = pd.read_sql(query5, connection)
/tmp/ipykernel_6545/2694205308.py:6: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  employees = pd.read_sql(query6, connection)
/tmp/ipykernel_6545/2694205308.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  salaries = pd.read_sql(query7, connection)
/tmp/ipykernel_6545/2694205308.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  titles = pd.read_sql(query8, connection)

In [62]:
current_dept_emp.head(10)

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01
5   10006    d005  1990-08-05  9999-01-01
6   10007    d008  1989-02-10  9999-01-01
7   10008    d005  1998-03-11  2000-07-31
8   10009    d006  1985-02-18  9999-01-01
9   10010    d006  2000-06-26  9999-01-01

In [63]:
departments.head(10)

  dept_no           dept_name
0    d009    Customer Service
1    d005         Development
2    d002             Finance
3    d003     Human Resources
4    d001           Marketing
5    d004          Production
6    d006  Quality Management
7    d008            Research
8    d007               Sales

In [64]:
dept_emp.head(10)

   emp_no dept_no   from_date     to_date
0   10001    d005  1986-06-26  9999-01-01
1   10002    d007  1996-08-03  9999-01-01
2   10003    d004  1995-12-03  9999-01-01
3   10004    d004  1986-12-01  9999-01-01
4   10005    d003  1989-09-12  9999-01-01
5   10006    d005  1990-08-05  9999-01-01
6   10007    d008  1989-02-10  9999-01-01
7   10008    d005  1998-03-11  2000-07-31
8   10009    d006  1985-02-18  9999-01-01
9   10010    d004  1996-11-24  2000-06-26

In [65]:
dept_emp_latest_date.head(10)

   emp_no   from_date     to_date
0   10001  1986-06-26  9999-01-01
1   10002  1996-08-03  9999-01-01
2   10003  1995-12-03  9999-01-01
3   10004  1986-12-01  9999-01-01
4   10005  1989-09-12  9999-01-01
5   10006  1990-08-05  9999-01-01
6   10007  1989-02-10  9999-01-01
7   10008  1998-03-11  2000-07-31
8   10009  1985-02-18  9999-01-01
9   10010  2000-06-26  9999-01-01

In [66]:
dept_manager.head(10)

   emp_no dept_no   from_date     to_date
0  110022    d001  1985-01-01  1991-10-01
1  110039    d001  1991-10-01  9999-01-01
2  110085    d002  1985-01-01  1989-12-17
3  110114    d002  1989-12-17  9999-01-01
4  110183    d003  1985-01-01  1992-03-21
5  110228    d003  1992-03-21  9999-01-01
6  110303    d004  1985-01-01  1988-09-09
7  110344    d004  1988-09-09  1992-08-02
8  110386    d004  1992-08-02  1996-08-30
9  110420    d004  1996-08-30  9999-01-01

In [67]:
employees.head(10)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10001  1953-09-02     Georgi    Facello      M  1986-06-26
1   10002  1964-06-02    Bezalel     Simmel      F  1985-11-21
2   10003  1959-12-03      Parto    Bamford      M  1986-08-28
3   10004  1954-05-01  Chirstian    Koblick      M  1986-12-01
4   10005  1955-01-21    Kyoichi   Maliniak      M  1989-09-12
5   10006  1953-04-20     Anneke    Preusig      F  1989-06-02
6   10007  1957-05-23    Tzvetan  Zielinski      F  1989-02-10
7   10008  1958-02-19     Saniya   Kalloufi      M  1994-09-15
8   10009  1952-04-19     Sumant       Peac      F  1985-02-18
9   10010  1963-06-01  Duangkaew   Piveteau      F  1989-08-24

In [91]:
salaries.head(10)

   emp_no  salary   from_date     to_date
0   10001   60117  1986-06-26  1987-06-26
1   10001   62102  1987-06-26  1988-06-25
2   10001   66074  1988-06-25  1989-06-25
3   10001   66596  1989-06-25  1990-06-25
4   10001   66961  1990-06-25  1991-06-25
5   10001   71046  1991-06-25  1992-06-24
6   10001   74333  1992-06-24  1993-06-24
7   10001   75286  1993-06-24  1994-06-24
8   10001   75994  1994-06-24  1995-06-24
9   10001   76884  1995-06-24  1996-06-23

In [69]:
titles.head(10)

   emp_no            title   from_date     to_date
0   10001  Senior Engineer  1986-06-26  9999-01-01
1   10002            Staff  1996-08-03  9999-01-01
2   10003  Senior Engineer  1995-12-03  9999-01-01
3   10004         Engineer  1986-12-01  1995-12-01
4   10004  Senior Engineer  1995-12-01  9999-01-01
5   10005     Senior Staff  1996-09-12  9999-01-01
6   10005            Staff  1989-09-12  1996-09-12
7   10006  Senior Engineer  1990-08-05  9999-01-01
8   10007     Senior Staff  1996-02-11  9999-01-01
9   10007            Staff  1989-02-10  1996-02-11

## Summary Statistics

In [95]:
query = """
    WITH cte AS (
        SELECT employees.emp_no AS emp_no_employee, 
               employees.first_name, 
               employees.last_name, 
               titles.title, 
               titles.from_date, 
               titles.to_date
        FROM employees 
        INNER JOIN titles ON employees.emp_no = titles.emp_no 
    )
    SELECT emp_no_employee, first_name, last_name, title, salary FROM cte inner join salaries on cte.emp_no_employee = salaries.emp_no limit 20;
"""

pd.read_sql_query(query, connection)

/tmp/ipykernel_6545/2260482515.py:15: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, connection)

    emp_no_employee first_name last_name            title  salary
0             10001     Georgi   Facello  Senior Engineer   60117
1             10001     Georgi   Facello  Senior Engineer   62102
2             10001     Georgi   Facello  Senior Engineer   66074
3             10001     Georgi   Facello  Senior Engineer   66596
4             10001     Georgi   Facello  Senior Engineer   66961
5             10001     Georgi   Facello  Senior Engineer   71046
6             10001     Georgi   Facello  Senior Engineer   74333
7             10001     Georgi   Facello  Senior Engineer   75286
8             10001     Georgi   Facello  Senior Engineer   75994
9             10001     Georgi   Facello  Senior Engineer   76884
10            10001     Georgi   Facello  Senior Engineer   80013
11            10001     Georgi   Facello  Senior Engineer   81025
12            10001     Georgi   Facello  Senior Engineer   81097
13            10001     Georgi   Facello  Senior Engineer   84917
14            10001     Georgi   Facello  Senior Engineer   85112
15            10001     Georgi   Facello  Senior Engineer   85097
16            10001     Georgi   Facello  Senior Engineer   88958
17            10002    Bezalel    Simmel            Staff   65828
18            10002    Bezalel    Simmel            Staff   65909
19            10002    Bezalel    Simmel            Staff   67534

In [100]:
query = """
    select emp_no, sum(salary) as total_salary_peer_employee from salaries group by emp_no limit 50;
"""

pd.read_sql_query(query, connection)

/tmp/ipykernel_6545/1494190767.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  pd.read_sql_query(query, connection)

    emp_no  total_salary_peer_employee
0    10001                   1281612.0
1    10002                    413127.0
2    10003                    301212.0
3    10004                    904196.0
4    10005                   1134585.0
5    10006                    606179.0
6    10007                    991574.0
7    10008                    147923.0
8    10009                   1409122.0
9    10010                    460338.0
10   10011                    348474.0
11   10012                    469028.0
12   10013                    891337.0
13   10014                    476913.0
14   10015                     40000.0
15   10016                    374977.0
16   10017                    870647.0
17   10018                   1098241.0
18   10019                    188029.0
19   10020                    216391.0
20   10021                   1029743.0
21   10022                    121283.0
22   10023                    148315.0
23   10024                    452862.0
24   10025                    571545.0
25   10026                    466023.0
26   10027                    346554.0
27   10028                    378991.0
28   10029                    790575.0
29   10030                    709681.0
30   10031                    529963.0
31   10032                    736237.0
32   10033                    391918.0
33   10034                    257716.0
34   10035                    782683.0
35   10036                    595762.0
36   10037                    604960.0
37   10038                    723650.0
38   10039                    795782.0
39   10040                    620921.0
40   10041                    914464.0
41   10042                    706632.0
42   10043                    773003.0
43   10044                    457209.0
44   10045                    267334.0
45   10046                    544517.0
46   10047                    975314.0
47   10048                     79507.0
48   10049                    477010.0
49   10050                   1067848.0